module test_bench;

    // Сигналы для тестирования
    logic clk;
    logic [7:0] x1;
    logic [7:0] x2;
    logic [7:0] dout;

    parameter CLK_PERIOD = 10; 

    lab93 inst_lab93 (
        .clk(clk),
        .x1(x1),
        .x2(x2),
        .dout(dout)
    );

    always begin
        #(CLK_PERIOD / 2);
        clk = ~clk;       
    end

    // Основной тест
    initial begin
        clk = 0;
        // Тест 1: Положительные 
        x1 = 8'b01000000; // 4 в формате (1,8,4)
        x2 = 8'b01000000; // 4 в формате (1,8,4)
        #(5*CLK_PERIOD)

        // Тест 2: Отрицательное и положительное 
        x1 = 8'b11000000; // -4.0 в формате (1,8,4)
        x2 = 8'b01000000; // 4 в формате (1,8,4)
        #(5*CLK_PERIOD);

        // Тест 3: Положительное и отрицательное значение
        x1 = 8'b00000001; // 0.625 в формате (1,8,4)
        x2 = 8'b11000000; // -4.0 в формате (1,8,4)
        #(5*CLK_PERIOD);

        // Тест 4: Отрицательные значения
        x1 = 8'b11000000; // -4.0 в формате (1,8,4)
        x2 = 8'b11100000; // -2 в формате (1,8,4)
        #(5*CLK_PERIOD) 
        
        x1 = 8'b10000000; // -8 в формате (1,8,4)
        x2 = 8'b0111_1111; // 7.9375 в формате (1,8,4)
        #(5*CLK_PERIOD) 
        $finish;
    end

endmodule


