module test_bench;

    // Сигналы для тестирования
    logic clk;
    logic [15:0] x1;
    logic [8:0] x2;
    logic [20:0] dout;

    parameter CLK_PERIOD = 10; 

    lab91 inst_lab91 (
        .clk(clk),
        .x1(x1),
        .x2(x2),
        .dout(dout)
    );

    always begin
        #(CLK_PERIOD / 2);
        clk = ~clk;       
    end

    // Основной тест
    initial begin
        clk = 0;
        // Тест 1: Положительные 
        x1 = 16'b00000001_00000001; // 1.0 в формате (1,16,8)
        x2 = 8'b01000000;           // 0.015625 в формате (1,8,12)
        #(5*CLK_PERIOD)

        // Тест 2: Отрицательное и положительное 
        x1 = 16'b11111111_00000000; // -1.0 в формате (1,16,8)
        x2 = 8'b01000000;           // 0.015625 в формате (1,8,12)
        #(5*CLK_PERIOD);

        // Тест 3: Положительное и отрицательное значение
        x1 = 16'b00000001_00000000; // 1.0 в формате (1,16,8)
        x2 = 8'b11000000;           // -0.015625 в формате (1,8,12)
        #(5*CLK_PERIOD);

        // Тест 4: Отрицательные значения
        x1 = 16'b11111111_00000000; // -1.0 в формате (1,16,8)
        x2 = 8'b11000000;           // -0.015625 в формате (1,8,12)
        #(5*CLK_PERIOD) 
        
        x1 = 16'b11111111_00000000; // -1.0 в формате (1,16,8)
        x2 = 8'b11000000;           // -0.015625 в формате (1,8,12)
        #(5*CLK_PERIOD) 
        $finish;
    end

endmodule

